Tratamento de dados ausentes

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A': [1,2,np.nan],
                   'B': [5,np.nan,np.nan],
                   'C': [1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [9]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [10]:
df.fillna('Conteudo')

          A         B  C
0       1.0       5.0  1
1       2.0  Conteudo  2
2  Conteudo  Conteudo  3

In [12]:
df["A"].mean()

1.5

In [14]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [16]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
df.ffill()

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [17]:
df.bfill()

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Groupby

In [1]:
import pandas as pd
#cria um DataFrame
data = {'Classe': ['Júnior', 'Júnior', 'Pleno', 'Pleno', 'Sênior', 'Sênior'],
'Nome': ['Jorge', 'Carlos', 'Roberta', 'Patrícia', 'Bruno', 'Vera'],
'Venda': [200, 120, 340, 124, 243, 350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [4]:
group = df.groupby("Classe")

In [5]:
group.sum()

                   Nome  Venda
Classe
Júnior      JorgeCarlos    320
Pleno   RobertaPatrícia    464
Sênior        BrunoVera    593

In [6]:
group.mean(numeric_only=True)

        Venda
Classe
Júnior  160.0
Pleno   232.0
Sênior  296.5

In [7]:
df.groupby("Classe").min()

            Nome  Venda
Classe
Júnior    Carlos    120
Pleno   Patrícia    124
Sênior     Bruno    243

In [8]:
df.groupby("Classe").max()

           Nome  Venda
Classe
Júnior    Jorge    200
Pleno   Roberta    340
Sênior     Vera    350

In [9]:
df2 = df.copy()

In [10]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [11]:
df2["Venda"] = [150, 432, 190, 230, 410, 155]

In [12]:
df

   Classe      Nome  Venda
0  Júnior     Jorge    200
1  Júnior    Carlos    120
2   Pleno   Roberta    340
3   Pleno  Patrícia    124
4  Sênior     Bruno    243
5  Sênior      Vera    350

In [13]:
df2

   Classe      Nome  Venda
0  Júnior     Jorge    150
1  Júnior    Carlos    432
2   Pleno   Roberta    190
3   Pleno  Patrícia    230
4  Sênior     Bruno    410
5  Sênior      Vera    155

In [14]:
df3 = pd.concat([df, df2])

In [15]:
df3.groupby(["Classe", "Nome"]).sum()

                 Venda
Classe Nome
Júnior Carlos      552
       Jorge       350
Pleno  Patrícia    354
       Roberta     530
Sênior Bruno       653
       Vera        505

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1','A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']},
index=[0,1,2,3])

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5','A6', 'A7'],
'B': ['B4', 'B5', 'B6', 'B7'],
'C': ['C4', 'C5', 'C6', 'C7'],
'D': ['D4', 'D5', 'D6', 'D7']},
index=[4,5,6,7])

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9','A10', 'A11'],
'B': ['B8', 'B9', 'B10', 'B11'],
'C': ['C8', 'C9', 'C10', 'C11'],
'D': ['D8', 'D9', 'D10', 'D11']},
index=[8,9,10,11])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [8]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [9]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [10]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3']})

In [11]:
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']})

In [12]:
pd.merge(esquerda, direita, on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [14]:
esquerda = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
'key2': ['K0', 'K1', 'K0', 'K1'],
'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3']})

In [15]:
direita = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
'key2': ['K0', 'K0', 'K0', 'K0'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']})

In [16]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [18]:
pd.merge(esquerda, direita, how="right", on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [19]:
esquerda = pd.DataFrame({'A': ['A0', 'A1','A2'],
'B': ['B0', 'B1', 'B2']},
index=['K0', 'K1', 'K2'])

In [20]:
direita = pd.DataFrame({'C': ['C0', 'C2','C3'],
'D': ['D0', 'D2', 'D3']},
index=['K0', 'K2', 'K3'])

In [21]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [1]:
import pandas as pd
df = pd.DataFrame({'col1': [1,2,3,4], 'col2':[444, 555, 666, 444], 'col3':['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [3]:
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

Informaçoes sobre valores exclusivos

In [4]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df["col2"].unique()

array([444, 555, 666], dtype=int64)

In [6]:
df["col2"].nunique()

3

In [7]:
df["col2"].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

aplicando funçoes

In [8]:
def comp(x):
    return x ** 2 + 3

In [9]:
df["col1"].apply(comp)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [12]:
df['col1_calc'] = df['col1'].apply(comp)

In [13]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [14]:
df['col1'].apply(lambda x: x ** 2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [16]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [17]:
df["col1"].sum()

10

In [18]:
df["col1"].mean()

2.5

In [19]:
df["col1"].product()

24

In [20]:
df["col1"].std()

1.2909944487358056

In [21]:
df["col1"].max()

4

In [22]:
df["col1"].min()

1

In [23]:
df["col1"].idxmax()

3

In [24]:
df[df["col2"] == 444]

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19

In [25]:
df[df["col2"] == 444]["col1"].sum()

5

In [26]:
df.sort_values(by="col2")

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19
1     2   555  def          7
2     3   666  ghi         12

In [27]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
'B':['one', 'one', 'two', 'two', 'one', 'one'],
'C': ['x', 'y', 'x', 'y', 'x', 'y'],
'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [28]:
dict_map = {"one": "1" , "two": "2"}

In [29]:
df["E"] = df["B"].map(dict_map)

In [30]:
df.pivot_table(index="A", columns="B", values="D")

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0